Revit 2027 API
MEPCurveType.RoutingPreferenceManager Property
 The RoutingPreferenceManager for the MEPCurveType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoutingPreferenceManager RoutingPreferenceManager { get; }
Public ReadOnly Property RoutingPreferenceManager As RoutingPreferenceManager
	Get
public:
property RoutingPreferenceManager^ RoutingPreferenceManager {
	RoutingPreferenceManager^ get ();
}
member RoutingPreferenceManager : RoutingPreferenceManager with get
Property Value
RoutingPreferenceManager
See Also
Reference
MEPCurveType Class
Autodesk.Revit.DB Namespace